tap "cloudflare/cloudflare"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "shopify/shopify"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Asynchronous event library
brew "libevent"
# Emacs dependency management
brew "cask"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Terminal-based visual file manager
brew "midnight-commander"
# Remote terminal application
brew "mosh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@20"
# Manage multiple Node.js versions
brew "nvm"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Pure Python Vim clone
brew "pyvim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Open source continuous file synchronization application
brew "syncthing"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Terminal multiplexer
brew "tmux"
# Language for application scale JavaScript development
brew "typescript"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
# Theme Kit is a tool kit for manipulating shopify themes
brew "shopify/shopify/themekit"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-hack-nerd-font"
cask "font-sf-pro"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Vector graphics editor
cask "inkscape"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Discover, download, and run local LLMs
cask "lm-studio"
# WordPress local development tool by Flywheel
cask "local"
# Open-source software for live streaming and screen recording
cask "obs"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Music streaming service
cask "spotify"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Open-source code editor
cask "visual-studio-code"
# Remote desktop application focusing on security
cask "vnc-viewer"
mas "1Password 7", id: 1333542190
mas "Affinity Designer 2", id: 1616831348
mas "Amphetamine", id: 937984704
mas "Eagle for Safari", id: 1526651672
mas "Final Cut Pro", id: 424389933
mas "Motion", id: 434290957
mas "Nisus Thesaurus", id: 471448642
mas "Surfingkeys", id: 1609752330
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Ulysses", id: 1225570693
mas "WhatFont", id: 1437138382
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "andenetalexander.vim-cheatsheet"
vscode "antiantisepticeye.vscode-color-picker"
vscode "azemoh.one-monokai"
vscode "blinklang.blinksyntaxhl"
vscode "blinkshellinc.blink-fs"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bschulte.php-autocomplete"
vscode "cantonios.project-templates"
vscode "cipchk.cssrem"
vscode "continue.continue"
vscode "danielsanmedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "glenn2223.live-sass"
vscode "joaomoreno.github-sharp-theme"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kubescape.kubescape"
vscode "lizhizhuanshu.autolua-debugger"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.theme-1337"
vscode "ms-vscode.theme-materialkit"
vscode "oderwat.indent-rainbow"
vscode "pawelgrzybek.gatito-theme"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "sainoba.px-to-rem"
vscode "saoudrizwan.claude-dev"
vscode "simonsiefke.svg-preview"
vscode "syler.sass-indented"
vscode "techer.open-in-browser"
vscode "thekalinga.bootstrap4-vscode"
vscode "thenikso.github-plus-theme"
vscode "thomaspink.theme-github"
vscode "tjbartram.github-sharp-theme-redux"
vscode "tobiasalthoff.atom-material-theme"
vscode "uloco.theme-bluloco-dark"
vscode "vscodevim.vim"
vscode "whizkydee.material-palenight-theme"
vscode "xabikos.javascriptsnippets"
vscode "yummygum.city-lights-theme"
vscode "zhuangtongfa.material-theme"
