tap "eth-p/software"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Application launcher and productivity software
cask "alfred"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
mas "Amphetamine", id: 937984704
mas "ColorSnapper2", id: 969418666
mas "Final Cut Pro", id: 424389933
mas "Surfingkeys", id: 1609752330
mas "Tailscale", id: 1475387142
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "andenetalexander.vim-cheatsheet"
vscode "antiantisepticeye.vscode-color-picker"
vscode "azemoh.one-monokai"
vscode "blinklang.blinksyntaxhl"
vscode "blinkshellinc.blink-fs"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bschulte.php-autocomplete"
vscode "cantonios.project-templates"
vscode "cipchk.cssrem"
vscode "continue.continue"
vscode "danielsanmedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "glenn2223.live-sass"
vscode "joaomoreno.github-sharp-theme"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kubescape.kubescape"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.theme-1337"
vscode "ms-vscode.theme-materialkit"
vscode "oderwat.indent-rainbow"
vscode "pawelgrzybek.gatito-theme"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "sainoba.px-to-rem"
vscode "saoudrizwan.claude-dev"
vscode "simonsiefke.svg-preview"
vscode "syler.sass-indented"
vscode "techer.open-in-browser"
vscode "thekalinga.bootstrap4-vscode"
vscode "thenikso.github-plus-theme"
vscode "thomaspink.theme-github"
vscode "tjbartram.github-sharp-theme-redux"
vscode "tobiasalthoff.atom-material-theme"
vscode "uloco.theme-bluloco-dark"
vscode "vscodevim.vim"
vscode "whizkydee.material-palenight-theme"
vscode "xabikos.javascriptsnippets"
vscode "yummygum.city-lights-theme"
vscode "zhuangtongfa.material-theme"
