1password-beta
1password-cli
alacritty
asdcontrol-git
base
base-devel
bash-completion
bat
blueberry
brightnessctl
btop
btrfs-progs
clang
cups
cups-browsed
cups-filters
cups-pdf
docker
docker-buildx
docker-compose
dust
efibootmgr
evince
eza
fastfetch
fcitx5
fcitx5-gtk
fcitx5-qt
fd
ffmpegthumbnailer
figlet
firefox
fontconfig
fzf
git
github-cli
gnome-calculator
gnome-keyring
gnome-themes-extra
gst-plugin-pipewire
gum
gvfs-mtp
gvfs-smb
hypridle
hyprland
hyprland-qtutils
hyprlock
hyprpicker
hyprshot
hyprsunset
imagemagick
impala
imv
inetutils
intel-ucode
iwd
jq
kdenlive
kitty
kmonad
kvantum-qt5
lazydocker
lazygit
less
libpulse
libqalculate
libreoffice-fresh
libyaml
limine
limine-mkinitcpio-hook
limine-snapper-sync
linux
linux-firmware
llvm
localsend-bin
luarocks
macbook12-spi-driver-dkms
mako
man-db
mariadb-libs
mise
mosh
mpv
nautilus
neovim
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
nss-mdns
obs-studio
obsidian
omarchy-chromium
omarchy-lazyvim
pamixer
pinta
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
playerctl
plocate
plymouth
polkit-gnome
postgresql-libs
power-profiles-daemon
python-gobject
python-poetry-core
python-terminaltexteffects
qt5-wayland
ripgrep
rust
satty
signal-desktop
slurp
snapper
spotify
starship
superfile
sushi
swaybg
swayosd
system-config-printer
tldr
tmux
tree-sitter-cli
ttf-cascadia-mono-nerd
ttf-ia-writer
ttf-jetbrains-mono-nerd
typora
tzupdate
ufw
ufw-docker
unzip
uwsm
walker-bin
waybar
wf-recorder
wget
whois
wireless-regdb
wiremix
wireplumber
wl-clip-persist
wl-clipboard
wl-screenrec
woff2-font-awesome
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xmlstarlet
xournalpp
yaru-icon-theme
yay
zoxide
zram-generator
zsh
